README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Gravity game</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-10-05 Tue"/>
<meta name="author" content="Alex Henning"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Gravity game</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Introduction </h2>
<div class="outline-text-2" id="text-1">

<p>In this game, you are a sad little asteroid out in the big bad galaxy. Your goal is to avoid crashing as long as possible, however, the galaxy is out to get you! The longer you last, the more asteroids are trying to hit you. How long can you last?
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">About </h2>
<div class="outline-text-2" id="text-2">

<p>I wrote this game back in 2009 in two days, while in New Orleans for FIRST robotics. It was the product of a mixture of boredom and curiosity. I'm putting it online now because a few people have been asking for it.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Installation </h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>
Install <a href="http://www.python.org/download/">python 2.7</a>.
</li>
<li>
Install <a href="http://www.pygame.org/download.shtml">pygame 1.91 for python 2.6</a>.
</li>
<li>
Download and extract the source for the gravity game.
</li>
<li>
Double click "game.pyw"
</li>
<li>
Play!
</li>
</ol>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Alex Henning
</p>
<p class="date"> Date: 2010-10-05 Tue</p>
<p class="creator">HTML generated by org-mode 7.01trans in emacs 23</p>
</div>
</div>
</body>
</html>
